Tekla Open API Reference for Tekla Structures 2025
PlacingDirectionAttributes Properties
The PlacingDirectionAttributes type exposes the following members.
Properties
Name | Description
Negative
 The negative direction of placing.
Positive
 The positive direction of placing.
Top
See Also
Reference
PlacingDirectionAttributes Class
Tekla.Structures.Drawing Namespace